bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY40.xml
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal group="T" pad="PA4" function="default"/>
                        <signal group="OCB" pad="PA5" function="default"/>
                        <signal group="OCA" pad="PC0" function="default"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                    caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal group="SS" pad="PC0" function="default"/>
                        <signal group="SCK" pad="PC1" function="default"/>
                        <signal group="MISO" pad="PC2" function="default"/>
                        <signal group="MOSI" pad="PC4" function="default"/>
                    </signals>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
            <interrupt index="3" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
            <interrupt index="4" name="PCINT2" caption="Pin Change Interrupt Request 2"/>
            <interrupt index="5" name="WDT" caption="Watchdog Time-out"/>
            <interrupt index="6" name="TIM1_CAPT" caption="Timer/Counter1 Input Capture"/>
            <interrupt index="7" name="TIM1_COMPA" caption=" Timer/Counter1 Compare Match A"/>
            <interrupt index="8" name="TIM1_COMPB" caption=" Timer/Counter1 Compare Match B"/>
            <interrupt index="9" name="TIM1_OVF" caption="Timer/Counter1 Overflow"/>
            <interrupt index="10" name="TIM0_COMPA" caption="Timer/Counter0 Compare Match A"/>
            <interrupt index="11" name="TIM0_COMPB" caption="Timer/Counter0 Compare Match B"/>
            <interrupt index="12" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
            <interrupt index="13" name="ANA_COMP" caption="Analog Comparator"/>
            <interrupt index="14" name="ADC" caption="Conversion Complete"/>
            <interrupt index="15" name="TWI_SLAVE" caption="Two-Wire Interface"/>
            <interrupt index="16" name="SPI" caption="Serial Peripheral Interface"/>
            <interrupt index="17" name="QTRIP" caption="Touch Sensing"/>
        </interrupts>
        <interfaces>
            <interface name="TPI" type="tpi"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x92"/>
                <property name="SIGNATURE2" value="0x0e"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="BYTE0" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Brown-out Detector trigger level" mask="0x70" name="BODLEVEL"
                              values="ENUM_BODLEVEL"/>
                    <bitfield caption="Output external clock" mask="0x04" name="CKOUT"/>
                    <bitfield caption="Watch dog timer always on" mask="0x02" name="WDTON"/>
                    <bitfield caption="Disable external reset" mask="0x01" name="RSTDISBL"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection disabled; [BODLEVEL=111]" name="DISABLED" value="0x07"/>
                <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
                <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x31" size="1">
                    <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
