bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY40.xml
                <register caption="Port C Input Pins" name="PINC" offset="0x1B" size="1" mask="0x3F"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
                    <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
                </register>
                <register caption="Pull-up Enable Control Register" name="PUEA" offset="0x03" size="1" mask="0xFF"/>
                <register caption="Port A Data Register" name="PORTA" offset="0x02" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port A" name="DDRA" offset="0x01" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x00" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x19" size="1">
                    <bitfield caption="Compare Output Mode for Channel A bits" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode for Channel B bits" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter 0 Control Register B" name="TCCR0B" offset="0x18" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x20" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter" mask="0x10" name="PSR"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x24" size="1">
                    <bitfield caption="Timer/Counter1 Width" mask="0x80" name="TCW1"/>
                    <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN1"/>
                    <bitfield caption=": Input Capture Noise Canceler" mask="0x20" name="ICNC1"/>
                    <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="CTC1"/>
                    <bitfield caption="The Clock Select1 bits 2, 1, and 0 define the prescaling source of Timer1."
                              mask="0x07" name="CS1"/>
                </register>
                <register caption="Timer/Counter1 High" name="TCNT1H" offset="0x27" size="1" mask="0xFF"/>
                <register caption="Timer/Counter1 Low" name="TCNT1L" offset="0x23" size="1" mask="0xFF"/>
                <register caption="Timer/Counter 1 Output Compare Register A" name="OCR1A" offset="0x22" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter 1 Output Compare Register B" name="OCR1B" offset="0x21" size="1"
                          mask="0xFF"/>
                <register caption="Timer Interrupt Mask Register" name="TIMSK" offset="0x26" size="1">
                    <bitfield caption="Input Capture Interrupt Enable" mask="0x80" name="ICIE1"/>
                    <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
                    <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
                    <bitfield caption="Overflow Interrupt Enable" mask="0x09" name="TOIE"/>
                    <bitfield caption="Timer/Counter Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                </register>
                <register caption="Overflow Interrupt Enable" name="TIFR" offset="0x25" size="1">
                    <bitfield caption="Input Capture Flag" mask="0x80" name="ICF1"/>
                    <bitfield caption="Timer Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
                    <bitfield caption="Timer Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
                    <bitfield caption="Timer Overflow Flag" mask="0x09" name="TOV"/>
                    <bitfield caption="Output Compare Flag 0 B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Output Compare Flag 0 A" mask="0x02" name="OCF0A"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x17" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x16" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x15" size="1"
                          mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
